In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data = pd.read_csv('train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data.drop('PassengerId', inplace=True, axis=1)

In [5]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
data.drop('Name', inplace=True, axis=1)

In [7]:
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [11]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
data.isna().any()

Survived    False
Pclass      False
Sex         False
Age          True
SibSp       False
Parch       False
Ticket      False
Fare        False
Cabin        True
Embarked     True
dtype: bool

In [14]:
data['Age'].isna().sum()

177

In [15]:
data['Age'].fillna(data['Age'].mean(), inplace=True)

In [21]:
data['Cabin'].isna().sum()

687

In [23]:
len(data)

891

In [24]:
data.drop('Cabin', inplace=True, axis=1)

In [25]:
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,1,1,female,35.0,1,0,113803,53.1000,S
4,0,3,male,35.0,0,0,373450,8.0500,S

In [26]:
data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [27]:
data['Embarked'].isna().sum()

2

In [28]:
data['Embarked'].fillna('S', inplace=True)

In [29]:
data['Embarked'].isna().sum()

0

In [30]:
data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [31]:
data['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [32]:
data.drop(['SibSp','Parch','Ticket','Fare', 'Embarked'], inplace=True, axis=1)

In [33]:
data.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [37]:
gender_data = pd.DataFrame(data['Sex'])

In [45]:
encoded_data = pd.get_dummies(gender_data)

In [41]:
data.drop('Sex', inplace=True, axis=1)

In [46]:
encoded_data.head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [47]:
valid_data = pd.concat([data, encoded_data], axis=1)

In [48]:
valid_data.head()

   Survived  Pclass   Age  Sex_female  Sex_male
0         0       3  22.0           0         1
1         1       1  38.0           1         0
2         1       3  26.0           1         0
3         1       1  35.0           1         0
4         0       3  35.0           0         1

In [49]:
y = valid_data[['Survived']]

In [50]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [ ]:
valid_data.drop('Survived', inplace=True, axis=1)

In [58]:
valid_data.head()

   Pclass   Age  Sex_female  Sex_male
0       3  22.0           0         1
1       1  38.0           1         0
2       3  26.0           1         0
3       1  35.0           1         0
4       3  35.0           0         1

In [62]:
from sklearn.model_selection import train_test_split

In [63]:
X_train, X_test, y_train, y_test = train_test_split(valid_data, y, test_size=0.2)

In [67]:
X_test.head()

     Pclass        Age  Sex_female  Sex_male
743       3  24.000000           0         1
538       3  29.699118           0         1
215       1  31.000000           1         0
114       3  17.000000           1         0
728       2  25.000000           0         1

In [60]:
from sklearn.naive_bayes import GaussianNB

In [68]:
model = GaussianNB()

In [69]:
model.fit(X_train, y_train)

c:\users\prasad\appdata\local\programs\python\python37\lib\site-packages\sklearn\naive_bayes.py:207: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

GaussianNB(priors=None, var_smoothing=1e-09)

In [70]:
model.score(X_train, y_train)

0.7682584269662921

In [71]:
y_pred = model.predict(X_test)

In [72]:
model.classes_

array([0, 1], dtype=int64)

In [76]:
model.score(X_test, y_test)

0.8603351955307262

In [77]:
from sklearn.metrics import accuracy_score

In [78]:
accuracy_score(y_test, y_pred)

0.8603351955307262

In [81]:
data = X_test.iloc[9]

In [84]:
model.predict([data])

array([0], dtype=int64)

In [86]:
y_test.iloc[9]

Survived    0
Name: 144, dtype: int64

In [87]:
import pickle

In [93]:
pickle.dump(model, open("titanic.pkl", "wb"))

In [94]:
saved_model = pickle.load(open("titanic.pkl", "rb"))

In [95]:
saved_model.predict([data])

array([0], dtype=int64)

In [103]:
data

Pclass         2.0
Age           18.0
Sex_female     0.0
Sex_male       1.0
Name: 144, dtype: float64

In [99]:
z = [2.0, 18.0, 0.0, 1.0]

KeyError: 0